Revit 2027 API
VertexStreamPositionNormalColored.AddVertex Method
 Inserts a VertexStreamPositionNormalColored into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertex(
	VertexPositionNormalColored vertex
)
Public Sub AddVertex (
	vertex As VertexPositionNormalColored
)
public:
void AddVertex(
	VertexPositionNormalColored^ vertex
)
member AddVertex :
        vertex : VertexPositionNormalColored -> unit
Parameters
vertex VertexPositionNormalColored
 The vertex to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace